# Test file
# Вывод текста
print('Hello, Sergey!')
# Операции сложения
print(2 + 2)
print(2 + 5)
# Операция умножения
print(2 * 1111111111122222223423423)
# Комбинированные операции
print(3 + 5 * 4)
print((3 + 5) * 4)
print(11111 * 1111111)
# Целочисленное деление
print(40 // 8)
print(42 // 8)
# Остаток от деления
print(42 % 8)
# Расчет задачи 1 из раздела 1.5
# print(42 / (4 + 2 * (-2)))
# Расчет степени числа
print(2 ** 3)
# Расчет задачи 2 из раздела 1.5
print(2014 ** 14)
# Унарная операция
print(-+-42)
# Число с плавающей точкой
print(2.5)
# Операции над вещественными числами (нецелыми)
print(0.5 + 0.3)
print(1 / 3)
print(0.3 + 0.3 + 0.3)
print(2 ** 0.5)
# Запись вещественных чисел через e
print(5e-1)
print(1234e-2)
print(1234e2)
print(1.2345e3)
print(1.2345e-3)
# Возведение в степень вещественного числа
print(2014.0 ** 14)
# Деление вещественного числа
print(7 / 3)
print(7 // 3)
# Перевод евещественного числа (float) в целое число (int)
print(int(2.99))
print(int(-1.6))
# Результат вычисления вещественных и целых чисел
print(9 ** 19)
print(float(9 ** 19))
print(int(float(9 ** 19)))
print(9 ** 19 - int(float(9**19)))
# Определение типа данных
print(type(7))
print(type(7.0))