# Мой вариант
print('Вариант №1.')
a = int(input('Введите число a: '))
b = int(input('Введите число b: '))
c = int(input('Введите число c: '))
p = ((a + b + c) / 2)
S = ((p * (p-a) * (p - b) * (p - c)) ** 0.5)
print('Ответ №1:', S)

# Мой вариант - видоизменённый
print('Вариант №2.')
a, b, c = int(input('Введите число a: ')), int(input('Введите число b: ')), int(input('Введите число c: '))
p = ((a + b + c) / 2)
S = ((p * (p-a) * (p - b) * (p - c)) ** 0.5)
print('Ответ №2:', S)

# Вариант #3
print('Вариант №3.')
a, b, c = int(input('Введите число a: ')), int(input('Введите число b: ')), int(input('Введите число c: '))
print((((a+b+c)/2)*((b+c-a)/2)*((a-b+c)/2)*((a+b-c)/2))**0.5)
print('Ответ №2:', S)