# Тип комнаты
print('Задача по расчеты площади комнат - мой вариант.')
type_room = input('Введите тип комнаты: ')
if type_room == 'треугольник':
    a, b, c = int(input('Введите a: ')), int(input('Введите b: ')), int(input('Введите c: '))
    p = ((a + b + c) / 2)
    S = float(((p * (p - a) * (p - b) * (p - c)) ** 0.5))
    print('Площадь треугольной комнаты равна', S, '.')
elif type_room == 'прямоугольник':
    a, b = int(input('Введите a: ')), int(input('Введите b: '))
    S = float(a * b)
    print('Площадь прямоугольной комнаты равна', S, '.')
elif type_room == 'круг':
    r = int(input('Введите радиус окружности r: '))
    S = float(3.14 * (r ** 2))
    print('Площадь круглой комнаты равна', S, '.')
else:
    print('Такого типа комнат в Маливии не существует!')
