# Счастливый или обычный билет? - мой вариант
number = int(input('Введите номер билета: '))
half_1 = number // 1000     # Здесь разделяем число 123456 на 123
half_2 = number % 1000      # Здесь разделяем число 123456 на 456
num_1 = half_1 // 100       # Здесь разделяем число 123 на 1
num23 = half_1 % 100        # Здесь разделяем число 123 на 23
num_2 = num23 // 10         # Здесь разделяем число 23 на 2
num_3 = num23 % 10          # Здесь разделяем число 23 на 3
num_4 = half_2 // 100       # Здесь разделяем число 456 на 4
num_56 = half_2 % 100       # Здесь разделяем число 456 на 56
num_5 = num_56 // 10        # Здесь разделяем число 56 на 5
num_6 = num_56 % 10         # Здесь разделяем число 56 на 6
first_sum = num_1 + num_2 + num_3       # Сумма первых трех чисел
second_sum = num_4 + num_5 + num_6      # Сумма вторых трех чисел
if first_sum == second_sum:
    print('Счастливый')
else:
    print('Обычный')

# Вариант №1 с сайта
a, b, c, d, e, f = input()
n = int(a) + int(b) + int(c)
m = int(d)+int(e) + int(f)
if n == m:
    print('Счастливый')
else:
    print('Обычный')

# Вариант №2 с сайта
a = int(input())
n = a // 1000
k = a % 1000
if n % 10 + n // 100 + n // 10 % 10 == k % 10 + k // 100 + k // 10 % 10:
    print("Счастливый")
else:
    print("Обычный")

# Вариант №3 с сайта
b = input()
if int(b[0]) + int(b[1]) + int(b[2]) == int(b[3]) + int(b[4]) + int(b[5]):
    print("Счастливый")
else:
    print("Обычный")

# Вариант №4 с сайта