# GC-состав
# GC-состав является важной характеристикой геномных последовательностей и определяется как процентное соотношение
# суммы всех гуанинов и цитозинов к общему числу нуклеиновых оснований в геномной последовательности.
# Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке
# (программа не должна зависеть от регистра вводимых символов).
#  Например, в строке "acggtgttat" процентное содержание символов G и C равно 40.0, где 4 - это количество символов G и
#  C,  а 10 - это длина строки.
genome = input('Введите вашу GC строку, например, acggtgttat): ')
C = genome.upper().count('C')
G = genome.upper().count('G')
sum_symbols = 0
for i in genome:
    sum_symbols += 1
result = ((C + G) / sum_symbols) * 100
print(result)
