# ДНК
# Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы
# информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.
# Кодирование осуществляется следующим образом:
# s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот
# символ и количество его повторений в этой позиции строки. Напишите программу, которая считывает строку, кодирует её
# предложенным алгоритмом и выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать
# регистр символов.
# Мой вариант через while
dnk = input('Введите произвольную строку, содержащую любые символы: ')
i = 0
j = i + 1
count = 1
while i < len(dnk):
    s = dnk + '1'
    if s[i] == s[j]:
        count += 1
    elif s[i] != s[j]:
        print(s[i] + str(count), end='')
        count = 1
    else:
        print('Упс, что-то пошло не так!')
    i += 1
    j += 1

# Мой вариант через for
dnk = input('Введите произвольную строку, содержащую любые символы: ')
i = 0
j = i + 1
count = 1
for letter in dnk:
    s = dnk + '1'
    if s[i] == s[j]:
        count += 1
    elif s[i] != s[j]:
        print(s[i] + str(count), end='')
        count = 1
    else:
        print('Упс, что-то пошло не так!')
    i += 1
    j += 1
