# Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел.
# Используйте метод split строки.
# Мой вариант
numbers = [int(i) for i in input('Строка из целых чисел через пробел: ').split()]    # вводим список из целых чисел
sum_numbers = 0                                                                      # приравниваем сумму чисел к 0
for number in numbers:                                                               # считываем числа из списка
    sum_numbers = sum_numbers + number                                               # суммируем числа в цикле
print(sum_numbers)                                                                   # выводим результат суммы

# Вариант из сайта
a = sum([int(i) for i in input().split()])
print(a)