# Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента этого
# списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей считается элемент,
# находящий на противоположном конце этого списка. Например, если на вход подаётся список "1 3 5 6 10", то на выход
# ожидается список "13 6 9 15 7" (без кавычек), потому что 3+10 1+5 3+6 6+1. Если на вход пришло только одно число,
# надо вывести его же. Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.
# Мой вариант
numbers = [int(i) for i in input('Строка из целых чисел через пробел: ').split()]   # вводим целые числа через пробел
j = 0                                                                               # задаем j = 0 для считывания списка
while j != len(numbers):                                                            # пока j != длине спискаб вып. цикл
    if j == 0 and len(numbers) == 1:                                                # j = 0 и длина списка = 1
        result = numbers[j]                                                         # само число
        print(result, end=' ')                                                      # вывести результат на экран с проб.
    elif j == 0 and len(numbers) != 1:                                              # j = 0 и длина списка != 1
        result = numbers[len(numbers) - 1] + numbers[j + 1]                         # сумма последнего и второго элем.
        print(result, end=' ')                                                      # вывести результат на экран с проб.
    elif j == len(numbers) - 1:                                                     # j - последний элемент списка
        result = numbers[len(numbers) - 2] + numbers[0]                             # сумма предпоследнего и первого
        print(result, end=' ')                                                      # вывести результат на экран с проб.
    else:                                                                           # иначе - для всех остальных
        result = numbers[j - 1] + numbers[j + 1]                                    # сумма элементов до и после из сп.
        print(result, end=' ')                                                      # вывести результат на экран с проб.
    j += 1                                                                          # добавляем +1 после каждой итерации






