# Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента этого
# списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей считается элемент,
# находящий на противоположном конце этого списка. Например, если на вход подаётся список "1 3 5 6 10", то на выход
# ожидается список "13 6 9 15 7" (без кавычек), потому что 3+10 1+5 3+6 6+1. Если на вход пришло только одно число,
# надо вывести его же. Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.
# Вариант из сайта:
numbers = [int(i) for i in input().split()]
l = len(numbers)
sums = list(numbers[i - 1] + numbers[(i + 1) % l] for i in range(l)) if l > 1 else [numbers[0]]
for res in sums:
	print(res, end=' ')
