# Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения,
# которые встречаются в нём более одного раза. Для решения задачи может пригодиться метод sort списка.
# Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.
numbers = [int(i) for i in input('Строка из целых чисел через пробел: ').split()]# вводим исходный список
numbers.sort()                                                                   # сортируем список
if len(numbers) == 1:                                                            # длина списка равна 1
    print('')                                                                    # напечатать пустую строку (для 10)
ind = 0                                                                          # задаем index для считывания списка
# Цикл для удаления элементов списка, что встречаются 1 раз
while ind < len(numbers):                                                        # считываем список по индексу
    if numbers.count(numbers[ind]) > 1:                                          # если встречаем символ > 1 раза
        ind += 1                                                                 # увеличиваем индекс для счит. след.
        continue                                                                 # продолжить
    elif numbers.count(numbers[ind]) == 1:                                       # если встречаем символ 1 раз (неповт.)
        numbers.remove(numbers[ind])                                             # удаляем его ис списка
    else:                                                                        # иначе
        print('Something wrong!')                                                # печатаем, что что-то не так
# Цикл для вывода уникальных значний списка
new_numbers = []                                                                 # создаем новый пустой список
for i in numbers:                                                                # считываем старый список поэлементно
    if i not in new_numbers:                                                     # если элемента нет в новом списке
        new_numbers.append(i)                                                    # добавть его в новый список
        print(i, end=' ')                                                        # и напечатать в строку с пробелом
