# Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения,
# которые встречаются в нём более одного раза. Для решения задачи может пригодиться метод sort списка.
# Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.
# Помещаю в новый список текущее число, если его там ещё нет. И если в исходном списке таких чисел несколько:
list = [int(i) for i in input().split()]        # создаем список
for i in set(list):                             # считываем УНИКАЛЬНЫЕ элементы списка используя set
    if list.count(i) > 1:                       # если счетчик встречающего числа больше 1 (встречается больше 1 раза)
        print(i, end=' ')                       # выводим поэлементно в строку все значения