# Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения,
# которые встречаются в нём более одного раза. Для решения задачи может пригодиться метод sort списка.
# Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.
a, b = [int(i) for i in input().split()], ''            # задаем СПИСОК и пустую СТРОКУ
a.sort()                                                # ортируем элементы списка
for i in range(len(a)-1):                               # проходимся по элементам списка
    if a[i] == a[i + 1] and a[i] != b:                  # если соседние элементы равны и отсутствует в СТРОКЕ b
        print(a[i], end=' ')                            # печатаем элемент в cтроку
        b = a[i]                                        # добавляем элемент в строку b
