# Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения,
# которые встречаются в нём более одного раза. Для решения задачи может пригодиться метод sort списка.
# Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.
s = [int(i) for i in input().split()]   # вводим список
s.sort()                                # сортируем список
i = 0                                   # задаем индекс для чтения списка
while i < len(s):                       # считываем список поэлементно
    if s.count(s[i]) > 1:               # если такое число повторяется > 1 раза
        print(s[i], end=' ')            # вывести на печать
        i += s.count(s[i])              # прибавляем к индексу количество повторений текущего элемента,
                                        # чтобы перескочить на первый отличающийся от текущего
    else:
        i += 1