# Минное поле
# Даны размеры поля для игры в сапер и координаты мин, стоящих в этом поле. Вывести поле игры на экран.
# Ввод              Вывод
# 5 4 4             *21.
# 1 1               3*2.
# 2 2               2*31
# 3 2               112*
# 4 4               ..11
# Вводим исходные данные, где n - количество строк, m - количество столбцов, k - количество мин
n, m, k = (int(i) for i in input('Введите количество строк, столбцов и мин через пробел: ').split())
# Генерируем двухмерный список (таблицу) на базе  введенных n/m  с нолями в матрице
matrix = [[0 for j in range(m)] for i in range(n)]
# Передираем количество мин согласно введенному значению k
for i in range(k):
    # Записываем позиции строчки и столбца в которы расположена каждая мина при проходе каждого i-го цикла
    row, col = (int(i) - 1 for i in input('Введите координаты мины через пробел: ').split())
    # Расставляем мины согласно координатам - записываем значение -1 в ячейку, где расположена мина
    matrix[row][col] = -1
# Заполнение таблицы - считаем количество мин (клеток которые содержат -1)
for i in range(n):                      # перебираем строки
    for j in range(m):                  # перебираем столбцы
        # Проверяем, что нет мин - клетки, в которых 0
        if matrix[i][j] == 0:
            # Если это так, то перебираем соседние строки (просто цифры -1 0 1)
            for di in range(-1, 2):
                # Перебираем соседние столбцы (просто цифры -1 0 1)
                for dj in range(-1, 2):
                    # координата по номеру строки
                    ai = i + di
                    # координата по имени столбца
                    aj = j + dj
                    # (ai, aj) Проверяем, что координаты клеток не выходят за границы и если попали на мину (-1):
                    if 0 <= ai < n and 0 <= aj < m and matrix[ai][aj] == -1:
                        # Увеличиваем значение клетки, чтобы проверить ее на наличие мины
                        matrix[i][j] += 1
# Перечитываем все ячейки таблицы на наличие мин - если есть -1, значит печатаем звездочку
print('Результат: ')
for i in range(n):
    for j in range(m):
        # если обнаружена мина, то ставим звездочку
        if matrix[i][j] == -1:
            print('*', end=' ')
        # если обнаружен ноль, то ставим точку
        elif matrix[i][j] == 0:
            print('.', end=' ')
        # в противном случае - вывести количество мин по соседству
        else:
            print(matrix[i][j], end=' ')
    print()