# Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел
# не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел. Гарантируется, что в какой-то
# момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно. В примере мы считываем
# числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов,
# не обращая внимания на то, что остались ещё не прочитанные значения.
your_number = int(input('Введите произвольное +/- число: '))     # Вводим произвольное +/- число
sq_your_number = your_number ** 2                                # Считаем квадрат этого числа
total = your_number                                              # Приравниваем сумму к первому введенному числу
total_sq = sq_your_number                                        # Приравниваем квадрат суммы числа с сумме квадратов
while total != 0:                                                # До тех пор пока сумма не равна нулю, выполняем цикл
    your_number = int(input('Введите произвольное +/- число: ')) # Просим снова ввести произвольное число
    sq_your_number = your_number ** 2                            # Висчитываем сумму этого числа
    total += your_number                                         # Добавляем полученное число к сумме
    total_sq += sq_your_number                                   # Добавляем к сумме квадратов квадрат введенного числа
    if total == 0:                                               # Если сумма равна 0
        for your_number in range(3):                             # Создаем цикл для запроса чисел, но в сумму не
            your_number = int(input('Введите произвольное +/- число: ')) # добавляем (согласно условию - продолжить ввод)
            break                                                # Прерываем цикл
print(total_sq)                                                  # Печатаем сумму квадартов после завершения цикла
