# Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел
# не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел. Гарантируется, что в какой-то
# момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно. В примере мы считываем
# числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов,
# не обращая внимания на то, что остались ещё не прочитанные значения.
numbers_sum, numbers_sq = 0, 0              # Задаем сумму раной 0 и сумму квадратов чисел раен 0
while True:                                 # До тех пор пока правда (1)
    number = int(input('Введите число: '))  # Вводим число
    numbers_sum += number                   # Добавляем к сумме веденное число
    numbers_sq += number * number           # Считаем квадрат введенного числа и добавляем его к сумме квадратов
    if numbers_sum == 0:                    # Если сумма чисел = 0
        break                               # Прерываем цикл
print(numbers_sq)
