# Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел
# не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел. Гарантируется, что в какой-то
# момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно. В примере мы считываем
# числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов,
# не обращая внимания на то, что остались ещё не прочитанные значения.
numbers_sum = [0, 0, 1]                                                  # задаем последовательность из 3 чисел
while numbers_sum[2]:                                                    # до тех пор, пока 3-й элемент не равен 0
    i = int(input('Введите ваше число: '))                               # запрос на ввод числа
    numbers_sum = [numbers_sum[0] + i, numbers_sum[1] + i ** 2, numbers_sum[0] + i] # суммируем числа в 1, 2 и квадрат 3
print(numbers_sum[1])                                                    # печать 1-го элемента (посредине), в случае 1, 3 = 0
