# Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ...
# (число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n —
# столько элементов последовательности должна отобразить программа. На выходе ожидается последовательность чисел,
# записанных через пробел в одну строку. Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
repeat_numbers = int(input('Введите ваше число: ')) # вводим количество символов, что должны получить на выходе
our_numbers = [i for i in range(1, 99)]             # генерируем последовательность чисел от 1 до 99
new_numbers = []                                    # новому списку (выходному) задаем пустое значение
for num in our_numbers:                             # для чисел из нашей последовательности
    for i in range(num):                            # задаем цикл считывания числа: 1 - 1 цикл, 2 - 2 цикла и т.д.
        if len(new_numbers) == repeat_numbers:      # если длина нового списка равна числу символов на входе
            break                                   # прерываем выполнение программы
        else:                                       # иначе
            new_numbers.append(num)                 # добавляем в выходную последовательность число
print(*new_numbers[:repeat_numbers])
