# Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ...
# (число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n —
# столько элементов последовательности должна отобразить программа. На выходе ожидается последовательность чисел,
# записанных через пробел в одну строку. Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
n = int(input('Введите ваше число: '))  # вводим число
a = []                                  # создаем выходной пустой список
i = 0                                   # счетчик для чисел приравниваем к 0
while len(a) < n:                       # до хе пор пока длина выходного списка меньше введенного числа
    a += [i] * i                        # добавляем число i cтолько раз, чему равно число
    i += 1                              # увеличиваем число
print(*a[:n])                           # печатаем список со срезом в количество символов, введеных в начале
