# Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ...
# (число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n —
# столько элементов последовательности должна отобразить программа. На выходе ожидается последовательность чисел,
# записанных через пробел в одну строку. Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
n = int(input('Введите ваше число: '))      # вводим число
count = 0                                   # задаем счетчик равный 0
curr = 1                                    # создаем число со значением 1
for i in range(n):                          # считываем список от 1 до n
    print(curr, end=' ')                    # выводим число на печать в строчку
    count += 1                              # добавляем 1 к счетчику
    if count == curr:                       # если счетчик равен полученному числу
        curr += 1                           # прибавляем 1 к числу
        count = 0                           # обнуляем счетчик
