# Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ...
# (число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n —
# столько элементов последовательности должна отобразить программа. На выходе ожидается последовательность чисел,
# записанных через пробел в одну строку. Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
a, b = int(input()), []         # входные данные - a - это число символов на выходе, а b - это пустой список
for i in range(1, a + 1):       # для чисел от 1 до a + 1 (не включая эту границу)
    b += [str(i)] * i           # добавить в список b строковое значение 'i'*i, т.е. 1, 2, 2, 3, 3, и т.д.
for i in b[:a]:                 # для элементов списка b до количества элементов n
    print(i, end=' ')           # вывести на экран в строчку
