# Напишите программу, которая считывает список чисел lst из первой строки и число xx из второй строки, которая выводит
# все позиции, на которых встречается число xx в переданном списке lst. Позиции нумеруются с нуля, если число xx не
# встречается в списке, вывести строку "Отсутствует" (без кавычек, с большой буквы).
lst = [int(i) for i in input('Введите последовательность чисел через пробел: ').split()] # вводим последовательность
your_num = int(input('Введите ваше число: '))          # вводим число, которое будем проверять
ind_lst = []                                           # создаем список для вывода индексов
if your_num not in lst:                                # для введенного числа в списке lst проверяем, есть ли оно
    print('Отсутствует')                               # если нет, то выдаем отсуствует
for ind in range(0, len(lst)):                         # для индексов из диапазона от ноля до длины списка
    if lst[ind] == your_num:                           # если элемент под индексом ind равен вашему числу
        ind_lst.append(ind)                            # добавляем в список индексов
    elif lst[ind] != your_num:                         # иначе, если не равно просто продолжаем
        continue                                       # просто продолжаем
print(*ind_lst)                                        # печатаем все элементы списка индексов в строку
