# Напишите программу, которая считывает список чисел lst из первой строки и число xx из второй строки, которая выводит
# все позиции, на которых встречается число xx в переданном списке lst. Позиции нумеруются с нуля, если число xx не
# встречается в списке, вывести строку "Отсутствует" (без кавычек, с большой буквы).
a = [int(i) for i in input().split()]       # вводим последовательность символов
b = int(input())                            # вводим число для проверки
if b in a:                                  # если b в a
    while b in a:                           # до тех пор пока b в a
        print(a.index(b), end=' ')          # печатаем в строку индекс элемента
        a[a.index(b)] = b + 1               # увеличиваем на 1
else:                                       # иначе
    print('Отсутствует')                    # печатаем, что оно отсуствует
