# Напишите программу, которая считывает список чисел lst из первой строки и число xx из второй строки, которая выводит
# все позиции, на которых встречается число xx в переданном списке lst. Позиции нумеруются с нуля, если число xx не
# встречается в списке, вывести строку "Отсутствует" (без кавычек, с большой буквы).
l, n = [int(i) for i in input().split()], int(input())                      # вводим последовательность символов и число
print(*[x for x in range(len(l)) if l[x] == n] if n in l else ["Отсутствует"])

