# Напишите программу, на вход которой подаётся прямоугольная матрица в виде последовательности строк, заканчивающихся
# строкой, содержащей только строку "end" (без кавычек). Программа должна вывести матрицу того же размера, у которой
# каждый элемент в позиции i, j равен сумме элементов первой матрицы на позициях (i-1, j), (i+1, j), (i, j-1), (i, j+1).
# У крайних символов соседний элемент находится с противоположной стороны матрицы. В случае одной строки/столбца
# элемент сам себе является соседом по соответствующему направлению.
# ВХОДНЫЕ ДАННЫЕ
a = [[int(i) for i in input('Введите элементы матрицы: ').split()]] # вводим элементы первой строки матрицы через пробел
b = input('Введите элементы матрицы: ')                             # вводим новую СТРОКУ
while b != 'end':                                                   # до тех пор, пока строка не равна end
    a.append([int(i) for i in b.split()])                           # перечитываем строку b и добавляем в матрицу
    b = input('Введите элементы матрицы: ')                         # вводим снова строку
print(a)
# КОПИРОВАНИЕ МАТРИЦЫ
b = a[:]
for i in range(len(a)):
    b[i] = a[i][:]
print(b)
print(len(b))
# ОБРАБОТКА МАССИВА
for i in range(len(b)):
    for j in range(len(b[i])):
        print(b[i][j], end=' ')
    print()

for i in range(len(b)):
    for j in range(len(b[i])):
        print()

