# Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. Для тренировок ему бы очень
# пригодилась программа, которая показывала бы блок таблицы умножения. Напишите программу, на вход которой даются
# четыре числа aa, bb, cc и dd, каждое в своей строке. Программа должна вывести фрагмент таблицы умножения для всех
# чисел отрезка [a; b][a;b] на все числа отрезка [c;d][c;d]. Числа aa, bb, cc и dd являются натуральными и не
# превосходят 10, a \le ba≤b, c \le dc≤d. Следуйте формату вывода из примера, для разделения элементов внутри строки
# используйте '\t' — символ табуляции. Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных
# отрезков — заголовочные столбец и строка таблицы.
# Таблица умножения Паши
print('Мой вариант: ')
a, b, c, d = int(input()), int(input()), int(input()), int(input())
while a > b or c > d or a > 10 or a < 0 or b > 10 or b < 0 or c > 10 or c < 0 or d > 10 or d < 0:
    a = int(input('\nВведите число a от 0 до 10: '))
    b = int(input('Введите число b от 0 до 10: '))
    c = int(input('Введите число c от 0 до 10: '))
    d = int(input('Введите число d от 0 до 10: '))
print('\t', end='')
for i in range(c, d + 1):
    print(i, end='\t')
print()
for j in range(a, b + 1):
    print(j, end='\t')
    for i in range(c, d + 1):
        print(j * i, end='\t')
    print()

# Вариант №1 с сайта:
print('\nВариант №1 с сайта: ')
a, b, c, d = int(input()), int(input()), int(input()), int(input())
for i in range(c, d + 1):
    print('\t', i, end='')
print()
for j in range(a, b + 1):
    print(j, end='\t')
    for k in range(c, d + 1):
        print(j * k, end='\t')
    print()

# Вариант №2 с сайта:
print('\nВариант №2 с сайта: ')
a, b, c, d = (int(input()) for x in range(4))
print('', *range(c, d + 1), sep='\t')
for x in range(a, b + 1):
    print(x, *[y * x for y in range(c, d + 1)], sep='\t')

input('\nДля выхода из программы нажмите любую клавишу! ')
