# На прошлой неделе мы сжимали строки, используя кодирование повторов. Теперь нашей задачей будет восстановление
# исходной строки обратно. Напишите программу, которая считывает из файла строку, соответствующую тексту, сжатому с
# помощью кодирования повторов, и производит обратную операцию, получая исходный текст. Запишите полученный текст в
# файл и прикрепите его, как ответ на это задание. В исходном тексте не встречаются цифры, так что код однозначно
# интерпретируем. Примечание. Это первое задание типа Dataset Quiz. В таких заданиях после нажатия "Start Quiz" у
# вас появляется ссылка "download your dataset". Используйте эту ссылку для того, чтобы загрузить файл со входными
# данными к себе на компьютер. Запустите вашу программу, используя этот файл в качестве входных данных.
# Выходной файл, который при этом у вас получится, надо отправить в качестве ответа на эту задачу.
with open('File1_for_3_9.txt') as data:         # открываем файл на чтение
    our_string = data.readline().strip()        # считываем нашу строку

result = ''                                     # создаем пустую строку для записи результата
alpha = ''                                      # создаем пустую строку для букв
digit = 0                                       # создаем переменую digit равную 0

for i in our_string:                            # считываем нашу строку
    if i.isalpha():                             # если элемент строки буква
        result += alpha * digit                 # в строку result добавлячем букву умноженную на цифру
        alpha = i                               # приравниваем букву к i
        digit = 0                               # обнуляем цифру
    if i.isdigit():                             # если элемент строки цифра
        digit = int(str(digit) + i)             # приравниваем digit к числу str(digit) + i

result += alpha * digit                         # результат - перемножение букв на цифры
print(result)
with open('File2_for_3_9.txt', 'w') as out:     # открываем файл на запись
    out.write(result)                           # записываем нашу выходную строку в файл.
