# Недавно мы считали для каждого слова количество его вхождений в строку. Но на все слова может быть не так интересно
# смотреть, как, например, на наиболее часто используемые. Напишите программу, которая считывает текст из файла
# (в файле может быть больше одной строки) и выводит самое частое слово в этом тексте и через пробел то, сколько раз
# оно встретилось. Если таких слов несколько, вывести лексикографически первое (можно использовать оператор < для строк)
# В качестве ответа укажите вывод программы, а не саму программу. Слова, написанные в разных регистрах, считаются
# одинаковыми.
# Открытие файлов - одного для считывания текста, а другого для записи результата в него
with open('File1_for_3_13.txt') as in_file, open('File2_for_3_13.txt','w') as out_file:
    maxc = 0                                    # задаем счетчик
    s = in_file.read().lower().strip().split()  # считываем строку из файла, приводим к нижнему регистру, удаляем пробел
    s.sort()                                    # сортируем символы строки
    for word in s:                              # для слов из строки s
        counter = s.count(word)                 # создаем переменную counter и приравниваем в счетчику
        if counter > maxc:                      # если counter больше ноля
            maxc = counter                      # задаем значение максимально каунтеру полученному значению
            result_word = word                  # результат приравниваем к полученному слову
    out_file.write(result_word + ' ' + str(maxc))   # записываем результат как конкатенацию двух строк







