# Недавно мы считали для каждого слова количество его вхождений в строку. Но на все слова может быть не так интересно
# смотреть, как, например, на наиболее часто используемые. Напишите программу, которая считывает текст из файла
# (в файле может быть больше одной строки) и выводит самое частое слово в этом тексте и через пробел то, сколько раз
# оно встретилось. Если таких слов несколько, вывести лексикографически первое (можно использовать оператор < для строк)
# В качестве ответа укажите вывод программы, а не саму программу. Слова, написанные в разных регистрах, считаются
# одинаковыми.
with open('File1_for_3_13.txt') as int_file:        # открываем файл на чтение
    text = int_file.read().lower().split()          # читаем текст в нижнем регистре, преобразуем строку в список
popular_word = max(set(text), key=text.count)       # находим максимально часто повторяющиеся слова и считаем их
print(popular_word, text.count(popular_word))       # выводим на печать







