# Недавно мы считали для каждого слова количество его вхождений в строку. Но на все слова может быть не так интересно
# смотреть, как, например, на наиболее часто используемые. Напишите программу, которая считывает текст из файла
# (в файле может быть больше одной строки) и выводит самое частое слово в этом тексте и через пробел то, сколько раз
# оно встретилось. Если таких слов несколько, вывести лексикографически первое (можно использовать оператор < для строк)
# В качестве ответа укажите вывод программы, а не саму программу. Слова, написанные в разных регистрах, считаются
# одинаковыми.
with open('File1_for_3_13.txt', 'r') as file:       # открываем файл на чтение
    s = file.read().strip().lower().split()         # считываем файл в список слов в нижнем регистре

z = {i: s.count(i) for i in s}                      # считаем количество повторяющихся слов в СПИСКЕ в СЛОВАРЬ

maximum = max(z, key=z.get)                         # высчитваем слово с максимальным количеством повторений
x = {maximum: z[maximum]}                           # создаем СЛОВАРЬ со словом максимально повторящимся количеством раз
for key, value in x.items():                        # считываем СЛОВАРЬ
    print(key, value)                               # печатаем ключ и его значение в виде key value







