# Имеется файл с данными по успеваемости абитуриентов. Он представляет из себя набор строк, где в каждой строке записана
# следующая информация: Фамилия;Оценка_по_математике;Оценка_по_физике;Оценка_по_русскому_языку
# Поля внутри строки разделены точкой с запятой, оценки — целые числа. Напишите программу, которая считывает исходный
# файл с подобной структурой и для каждого абитуриента записывает его среднюю оценку по трём предметам на отдельной
# строке, соответствующей этому абитуриенту, в файл с ответом. Также вычислите средние баллы по математике, физике и
# русскому языку по всем абитуриентам и добавьте полученные значения, разделённые пробелом, последней строкой в файл с
# ответом. В качестве ответа на задание прикрепите полученный файл со средними оценками по каждому ученику и одной
# строкой со средними оценками по трём предметам. Примечание. Для разбиения строки на части по символу ';' можно
# использовать метод split следующим образом:
# print('First;Second-1 Second-2;Third'.split(';'))
# ['First', 'Second-1 Second-2', 'Third']
counter_str = 0                                                 # счетчик количества строк (учеников)
sum_oc = 0                                                      # суммаркое количество баллов по 3-м предметам
mid_student = []                                                # список для средних значений оценок ВСЕХ студентов
mid_val_s = []                                                  # создаем список для записи в него оценок по 3-м предм.
with open('File1_for_3_17.txt', 'r', encoding='utf-8') as text: # открываем файл на чтение
    for our_string in text:                                     # считываем наши строки построчно
        our_string = our_string.strip().split(';')              # преобразуем строки в списки (элементы через запятую)
        for i in range(1, 4):                                   # считываем оценки по 3-м предметам (1-3 эл. списка)
            sum_oc += int(our_string[i])                        # получаем сумму оценок суммируя лементы списка
            mid_val_s.append(our_string[i])                     # добавляем каждую оценку по 3 предметам в список
        mid_val = sum_oc / 3                                    # делим суму оценок для 3 предметов на 3 для пол. ср.зн.
        sum_oc = 0                                              # обнуляем сумму оценок до ноля
        mid_student.append(mid_val)                             # доб. среднее значение для каждого студента в список
        counter_str += 1                                        # увеличиваем счтётчик на 1
    our_res = ''                                                # задаем пустую строку для вывода результата
    for i in mid_student:                                       # считываем полученный список в строку с переходом
        our_res += str(i) + '\n'                                # на новую строку
    math = 0                                                    # баллы по математике
    for i in range(0, len(mid_val_s), 3):                       # считываем список со всеми оценками по мат.
        math += int(mid_val_s[i])                               # суммируем каждый 0-й, 3-й, 6-й... элементы
    phys = 0                                                    # баллы по физике
    for i in range(1, len(mid_val_s), 3):                       # считываем список со всеми оценками по физ.
        phys += int(mid_val_s[i])                               # суммируем каждый 1-й, 4-й, 7-й... элементы
    rus = 0                                                     # считываем список со всеми оценками по рус. яз.
    for i in range(2, len(mid_val_s), 3):                       # суммируем каждый 2-й, 5-й, 8-й... элементы
        rus += int(mid_val_s[i])                                # считываем список со всеми оценками по рус. яз.
    with open('File2_for_3_17.txt', 'w', encoding='utf-8') as our_reply:    # открываем файл на запись результата
        our_reply.write(our_res.strip())                        # выводим среднее арифметическое по каждому ученику
        our_reply.write('\n' + str(math/counter_str) + ' ' + str(phys/counter_str) + ' ' + str(rus/counter_str))
















