# Напишите функцию f(x), которая возвращает значение следующей функции, определённой на всей числовой прямой
# Требуется реализовать только функцию, решение не должно осуществлять операций ввода-вывода.
def modify_list(lst):               # Объявляем функцию
    i = 0                           # Задаем каунтер ля считывания последовательности
    while i < len(lst):             # До тех пор пока есть элементы в последовательности от 1 до len(lst)
        if lst[i] % 2 == 1:         # Если элемент последовательности делится с остатком
            lst.remove(lst[i])      # Удаляем такой элемент
        elif lst[i] % 2 == 0:       # В противном случае, когда делится без остатка
            i += 1                  # Счетчик увеличиваем на 1
    for i in range(len(lst)):       # Для новых элементов списка от 1 до len(lst)
            lst[i] = lst[i] // 2    # Делим все эелементы пополам


lst = [1, 2, 3, 4, 5, 6]
print(modify_list(lst))
print(lst)
modify_list(lst)
print(lst)
