# Напишите функцию update_dictionary(d, key, value), которая принимает на вход словарь d и два числа: key и value.
# Если ключ key есть в словаре d, то добавьте значение value в список, который хранится по этому ключу.
# Если ключа key нет в словаре, то нужно добавить значение в список по ключу 2*key. Если и ключа 2∗key нет, то нужно
# добавить ключ 2∗key в словарь и сопоставить ему список из переданного элемента [value].
# Требуется реализовать только эту функцию, кода вне её не должно быть.
# Функция не должна вызывать внутри себя функции input и print.
def update_dictionary(my_dict, key, value):       # объявляем функцию, которая будет обновлять словать по ключу/значению
    if key in my_dict:                            # если ключ key присуствует в словаре d, тогда:
        my_dict[key].append(value)                # добавляем ключ и его значение в виде СПИСКА
    elif key * 2 in my_dict:                      # иначе, ключа key нет в словаре, но есть 2 * key в словаре, тогда:
        my_dict[2 * key].append(value)            # добавляем новое значение в СПИСОК, который содержит ключ
    elif key not in my_dict:                      # в противном случае, если ключи key и 2 * key отсуствуют
        key = key * 2                             # создаем новый ключ
        my_dict[key] = []                         # и записываем в него пустой список
        my_dict[key].append(value)                # добавляем новое значие в созданный список


my_dict = {}
print(update_dictionary(my_dict, 1, -1))          # None
print(my_dict)                                    # будет применено 3-е условие в функции {2: [-1]}
update_dictionary(my_dict, 2, -2)
print(my_dict)                                    # будет примененео 1-е условие в функции {2: [-1, -2]}
update_dictionary(my_dict, 1, -3)                 #
print(my_dict)                                    # будет применено 2-е условие в функции {2: [-1, -2, -3]}