# Когда Антон прочитал «Войну и мир», ему стало интересно, сколько слов и в каком количестве используется в этой книге.
# Помогите Антону написать упрощённую версию такой программы, которая сможет подсчитать слова, разделённые пробелом и
# вывести получившуюся статистику.
# Программа должна считывать одну строку со стандартного ввода и выводить для каждого уникального слова в этой строке
# число его повторений (без учёта регистра) в формате "слово количество" (см. пример вывода).
# Порядок вывода слов может быть произвольным, каждое уникальное слово﻿ должно выводиться только один раз.
many_words = [str(i).lower() for i in input('Введите элементы матрицы: ').split()]  # вводим слова через пробел в строку
print(many_words)
print(type(many_words))
sorted_words = sorted(many_words)                                                   # сортируем слова в списке
i = 0                                                       # задаем нолевой индекс для элементов списка
j = i + 1                                                   # задаем индекс следующего элемента списка (для сравнения)
count = 1                                                   # счетчик выставляем в 1
sorted_words.append('1')                                    # добавляем с список еще 1 элемент
while i != len(sorted_words) - 1:                           # до тех пор пока индекс не равно длине списка sorted_words
    if sorted_words[i] == sorted_words[j]:                  # если текущий и следующий элемент списка равны
        count += 1                                          # увеличиваем счетчика на +1
    elif sorted_words[i] != sorted_words[j]:                # если текущий и следующий элемент списка НЕ равны
        print(sorted_words[i], str(count))                  # печатаем значиние элемента (слова) и количество повторений
        count = 1                                           # счетчик снова выставляем в 1
    else:                                                   # иначе
        print('Упс, что-то пошло не так!')                  # печатаем, что что-то пошло не так
    i += 1                                                  # после каждой итерации увеличиваем индекс на 1
    j += 1                                                  # после каждой итерации увеличиваем следующий индекс на 1

