# Когда Антон прочитал «Войну и мир», ему стало интересно, сколько слов и в каком количестве используется в этой книге.
# Помогите Антону написать упрощённую версию такой программы, которая сможет подсчитать слова, разделённые пробелом и
# вывести получившуюся статистику.
# Программа должна считывать одну строку со стандартного ввода и выводить для каждого уникального слова в этой строке
# число его повторений (без учёта регистра) в формате "слово количество" (см. пример вывода).
# Порядок вывода слов может быть произвольным, каждое уникальное слово﻿ должно выводиться только один раз.
many_words = input('Введите элементы матрицы: ').lower().split()        # вводим слова через пробел в строку
dictionary = dict()                                                     # объявляем пустой словарь
for word in many_words:                                                 # для слова из набора слов
    if word not in dictionary:                                          # если слово не в словаре
        dictionary[word] = 1                                            # значит выставлем 1 для него
    else:                                                               # иначе
        dictionary[word] += 1                                           # если слово в словаре, то увеличиваем на 1
for word, count in dictionary.items():                                  # для слова, счетчика в словаре
    print(word, count)                                                  # печатаем их значения



