# Напишите программу, которая считывает строку с числом n, которое задаёт количество чисел, которые нужно считать.
# Далее считывает n строк с числами xi, по одному числу в каждой строке. Итого будет n+1 строк. При считывании числа x_i
# программа должна на отдельной строке вывести значение f(xi). Функция f(x) уже реализована и доступна для вызова.
# Функция вычисляется достаточно долго и зависит только от переданного аргумента x.
# Для того, чтобы уложиться в ограничение по времени, нужно избежать повторного вычисления значений.
n = int(input('Введите количество чисел: '))                # задаем количество чисел, что надо ввести с клавиатуры
i = 1                                                       # задаем начальное число
my_dict = {}                                                # создаем пустой словарь
if n == 0:                                                  # если n = 0
    exit()                                                  # завершаем программу
else:                                                       # иначе
    while i != n + 1:                                       # до тех порт, пока счетчик не равен введенном учислу
        x = int(input('Введите число и нажмите Enter! '))   # вводим числа с клавиватуры
        if x in my_dict:                                    # если введенный ключ существует в словаре
            print(my_dict[x])                               # напечатать его значение
            i += 1                                          # увеличить счетчик на 1 для ввода следующего числа
        else:                                               # иначе
            my_dict[x] = []                                 # записываем пустой список
            my_dict[x] = f(x)                               # записываем значение в словарь
            print(my_dict[x])                               # печатаем значение ключа x
            i += 1                                          # увеличить счетчик на 1 для ввода следующего числа
